app/Models/UsuarioModel.php

SELECT *
FROM `t_usuario`
WHERE `usuario` = 'admin'
---
   public function obtenerUsuario($data) {
    $Usuario = $this->db->table('t_usuario');
    $user = $data['usuario'];
    $pass = $data['password'];
    $Usuario->where('usuario', $user);

    return $Usuario->get()->getResultArray();